{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "place_order",
    "1": "create_account",
    "2": "track_order",
    "3": "check_cancellation_fee",
    "4": "contact_customer_service",
    "5": "delivery_period",
    "6": "recover_password",
    "7": "cancel_order",
    "8": "registration_problems",
    "9": "review",
    "10": "set_up_shipping_address",
    "11": "get_refund",
    "12": "delete_account",
    "13": "switch_account",
    "14": "edit_account",
    "15": "payment_issue",
    "16": "complaint",
    "17": "track_refund",
    "18": "change_order",
    "19": "check_invoice",
    "20": "change_shipping_address",
    "21": "newsletter_subscription",
    "22": "contact_human_agent",
    "23": "delivery_options",
    "24": "check_payment_methods",
    "25": "check_refund_policy",
    "26": "get_invoice"
  },
  "initializer_range": 0.02,
  "label2id": {
    "cancel_order": 7,
    "change_order": 18,
    "change_shipping_address": 20,
    "check_cancellation_fee": 3,
    "check_invoice": 19,
    "check_payment_methods": 24,
    "check_refund_policy": 25,
    "complaint": 16,
    "contact_customer_service": 4,
    "contact_human_agent": 22,
    "create_account": 1,
    "delete_account": 12,
    "delivery_options": 23,
    "delivery_period": 5,
    "edit_account": 14,
    "get_invoice": 26,
    "get_refund": 11,
    "newsletter_subscription": 21,
    "payment_issue": 15,
    "place_order": 0,
    "recover_password": 6,
    "registration_problems": 8,
    "review": 9,
    "set_up_shipping_address": 10,
    "switch_account": 13,
    "track_order": 2,
    "track_refund": 17
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.31.0",
  "vocab_size": 30522
}
